# 올해 새내기인 또리는 설레는 마음으로 MT를 갔습니다.
# 그곳에서 또리는 술 게임으로 소수 369 게임을 시작하게 되었습니다.
# 소수 369 게임은 다음과 같이 진행됩니다.
# 1. 한 사람씩 돌아가면서 1부터 자연수를 하나씩 부릅니다.
# 2. 이때, 불러야 하는 수가 소수인 경우에는 그 수를 부르는 대신 박수를 칩니다.
# 예를 들어서 빅과 또리가 둘이서 소수 369 게임을 진행하면 다음과 같게 됩니다.
# 빅: 1
# 또리: (박수 1회)
# 빅: (박수 1회)
# 또리: 4
# 빅: (박수 1회)
# 또리: 6
# ...
# 빅: 28
# 또리: (박수 1회)
# 빅: 30
# 또리: (박수 1회)
# 빅: 32
# ...
# 하지만 또리는 숫자에 약해서 소수 369 게임을 할 때마다 벌칙주를 마시게 되었습니다.
# 술이 들어가서 제정신이 아닌 또리를 위해 소수 369 게임을 대신해주는 프로그램을 작성해주세요.

# 예제 입력1
# 1
# 예제 출력1
# 1

# 예제 입력2
# 2
# 예제 출력2
# clap

# 입력값 설명
# 자연수 N이 주어집니다. (1 ≤ N ≤ 1,000)

# 출력값 설명
# N번째 차례가 되었을 때 해야하는 행동을 출력합니다.
# 숫자를 외쳐야하는 경우, 해당 수를 출력합니다.
# 박수를 쳐야하는 경우, "clap"을 큰따옴표를 제외하고 공백없이 출력합니다.